CREATE DATABASE  IF NOT EXISTS `eighteenprinces` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `eighteenprinces`;
-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: localhost    Database: eighteenprinces
-- ------------------------------------------------------
-- Server version	8.0.37

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `q1`
--

DROP TABLE IF EXISTS `q1`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `q1` (
  `Number` int NOT NULL AUTO_INCREMENT,
  `Question` varchar(45) DEFAULT NULL,
  `Option1` varchar(45) DEFAULT NULL,
  `Option2` varchar(45) DEFAULT NULL,
  `Option3` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`Number`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `q1`
--

LOCK TABLES `q1` WRITE;
/*!40000 ALTER TABLE `q1` DISABLE KEYS */;
INSERT INTO `q1` VALUES (1,'當董賊欲築高壘固守，我軍應如何破解此堅固之防線？','命弓弩手攻其守軍，繼以火矢焚其壘垣','繞壘而行，斷其糧草，迫其棄守而退','直攻其壘，試圖以人力壓倒敵防'),(2,'若董賊密謀於夜間突襲，吾等如何防範以保全軍營？','加強夜間巡邏，增設警戒哨，防止敵襲','於夜間多設陷阱，誘敵入彀，再行反擊','夜間放鬆戒備，認為敵不敢來襲'),(3,'如何破解董賊於隘口設伏之險計，使大軍順利通過？','派出先鋒部隊，清剿隘口伏兵，保障大軍通行','另擇隱秘之徑繞過隘口，避其伏兵 ','不顧隘口險計，硬闖而過'),(4,'面對董賊善於誘敵深入之計，我軍應如何應對？','保持陣型穩固，勿輕易追擊，避免陷入圈套','派出精兵偵察敵情，明確敵之誘計，再行應對','迅速追擊，期以猛攻取勝'),(5,'若董賊之士卒迷信，我軍如何運用此心理優勢？','製造虛假神示，迷惑敵軍，瓦解其鬥志','鼓吹己方神佑，以壯我軍士氣，挫敵氣焰','忽視敵軍迷信，僅依常法戰之'),(6,'當董賊於我軍內部施離間之計，如何保持同盟穩固？','定期召開盟主會議，強化信任與合作','加強內部溝通，及時澄清誤會，維持團結','忽視離間之計，自信內部無懈可擊'),(7,'若董賊擁有強弩兵，吾等應如何破其鋒芒？','以盾牌組成盾陣，抵擋弩矢，保護士卒之安全','快速接近敵軍，削弱弩兵之射擊優勢','依賴散兵游勇，以為可避開弩矢攻擊'),(8,'董賊若欲於水中埋伏大軍，我軍應如何應對？','於河流兩岸加強警戒，防止敵軍突襲於水中','派出船隻巡航，探明水中敵情，防範突襲','輕信水道之清淨，無設防備'),(9,'如何防範董賊於盟軍內部安插間諜，以保團結？','加強內部管理，杜絕間諜之滲透，保全軍中機密','設置密探，偵察內部動向，及早發現間諜','對間諜行動不加理會，認為不足為懼'),(10,'董賊善用重甲步兵，我軍應如何應對此鋒銳之勢？','以火箭射之，欲以火攻破其重甲','以輕兵繞後，攻其後方，避其鋒芒','與之正面對抗，依靠人數優勢'),(11,'董賊欲利用險峻山地作戰，我軍應如何迎敵？','選擇平坦地形決戰，避開山地險阻之地','派兵控制山頂，佔據有利高地，抵禦敵軍','不加考慮地形，盲目進軍'),(12,'若董賊企圖引我軍深入，後再行包圍，當如何應對？','以小股兵力試探敵意，勿輕易深入敵境','分兵行動，避免全軍陷入敵之包圍圈','全軍快速前進，以求迅速突破敵防線'),(13,'董賊若於隘路設伏，我軍應如何迅速通過？','派兵先行清剿隘路伏兵，再行大軍通過','繞道避開隘路，尋找其他安全通道','無視伏兵，強行突破隘路'),(14,'若董賊欲於河川中設下伏兵，我軍如何應對？','加強河川兩岸之警戒，防止敵軍潛伏於水中','派出船隻巡航，探查水中敵情，防範突襲','輕信河川無敵軍潛伏，不設防備'),(15,'若董賊軍中有疫，我軍應如何避免染病？','保持距離，設立防疫隔離區，避免傳染','加強軍營衛生，防止疫病蔓延','無視疫病風險，繼續正常軍事行動'),(16,'董賊欲以少數精銳襲擊我方後勤補給線，我軍當如何應對？','加強後勤護衛，增派兵力保護補給線','設置偵察哨，提前預警，防範敵軍突襲','認為敵軍不足為患，忽視後勤防禦'),(17,'若董賊之士卒疲憊，我軍當如何迅速發動進攻？','集結精銳部隊，迅速發起突襲，奪取戰機','以小股部隊騷擾，削弱敵軍士氣，然後總攻','等待敵軍自我崩潰，不立即行動'),(18,'面對董賊之強大騎兵，我軍應如何應對其衝鋒？','設置拒馬，阻擋騎兵衝鋒，削弱其攻勢','以長槍兵陣抵禦騎兵衝鋒，保持陣型穩固','與騎兵正面交戰，依賴步兵之勇力'),(19,'董賊之軍若陷於困境，我軍當如何利用此良機？','發起全力進攻，乘其不備，迅速擊潰之','包圍敵軍，切斷其退路，迫使其投降','觀望不動，等待敵軍自我崩潰'),(20,'若董賊之軍中食糧短缺，吾等應如何進一步削弱其戰力？','切斷其餘糧之路，使其陷入飢餓困境','發起頻繁騷擾，削弱其士氣，逼其投降','等待敵軍自然崩潰，不立即採取行動'),(21,'若董賊於荒野設伏，吾軍行進應如何避此險地？','派出斥候先行探路，確保前方無伏，再行進軍','避開荒野，另擇安全之道，避其伏兵','不加偵查，直接通過荒野'),(22,'若董賊欲於大軍過河之際伏擊，當如何防範？','先遣小隊探明對岸敵情，再行大軍渡河','於渡河之際設立防衛，防範敵軍襲擊','不設防備，快速渡河'),(23,'面對董賊之詭計誘我軍進陷阱，應如何破解？','謹慎行動，不入敵之陷阱，逐步試探敵情','派出斥候探查前方，確保安全後再行進軍','不顧陷阱，依計行事'),(24,'董賊欲於寒冬之際突襲，我軍應如何防範？','於營地四周加強防衛，設立火堆御寒，防止敵襲','選擇易守難攻之地紮營，加強警戒','無視寒冬，僅憑自身實力應對'),(25,'若董賊欲利用假情報擾亂軍心，吾等應如何應對？','加強內部信息管理，確保軍中情報之真實可靠','設立偵察部隊，核實情報，防範敵之謊言','輕信情報，不加核實'),(26,'若董賊意圖引我軍深入寒地，當如何應對？','慎重行軍，避免深入寒地，保全大軍之力','加強保暖措施，準備充分物資，再行進軍','不顧寒地惡劣，急於追擊'),(27,'董賊若欲以火攻燒毀我軍糧草，當如何防範？','分散儲存糧草，設置防火措施，減少火攻損失','加強糧草堆周邊防衛，防止敵軍接近','對糧草無特別防護措施'),(28,'若董賊欲於春夏之際利用疾病襲擊我軍，當如何應對？','加強軍中衛生管理，杜絕疫病之傳播','隔離病患，防止疾病蔓延，確保軍中安穩','對疾病不加重視，認為可自行痊癒'),(29,'面對董賊之重弩攻擊，我軍應如何應對其猛烈射擊？','以盾陣抵擋弩矢，並快速接近敵軍，縮短射擊距離','利用地形掩護，逐步接近敵陣，避免正面對抗','直接衝鋒，不設防備'),(30,'若董賊之先鋒部隊佔據險要之地，我軍應如何奪取？','派遣精銳之士迂迴包抄，奪取險要之地','以遠程攻擊削弱敵軍，再行正面進攻','不顧地勢險要，強行奪取');
/*!40000 ALTER TABLE `q1` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-07-02  0:14:07
